ymaps.ready(init_ymap);
    var myMap, myPlacemark;

    function init_ymap(){ 
		//Создаем карту
		myMap = new ymaps.Map("map", {
            center: [54.63, 39.74],
            zoom: 11,
			controls: ['zoomControl'] 
        }); 
		
		 // Создаем многоугольник, используя вспомогательный класс Polygon.
		var myPolygon = new ymaps.Polygon([
			// Указываем координаты вершин многоугольника.
			// Координаты вершин внешнего контура.
			[[54.583819024828344, 39.749239041116546],
			 [54.583811760509356, 39.78122731106164],
			 [54.58031830670132, 39.79717853069176],
			 [54.580713526218545, 39.82102617366116],
			 [54.595162000948335, 39.84434554406952],
			 [54.61022808277366, 39.83861122642971],
			 [54.62284822012943, 39.80137704611857],
			 [54.63211701324001, 39.78603481055351],
			 [54.64098542970245, 39.7689759612187],
			 [54.64000222034526, 39.7369181990727],
			 [54.648389846765944, 39.69958184958508],
			 [54.6814753825741, 39.65306161643118],
			 [54.68386246409271, 39.64928506613862],
			 [54.68048072365977, 39.64379190207595],
			 [54.67869027592293, 39.64756845236859],
			 [54.67550706187833, 39.64001535178203],
			 [54.669736847435715, 39.64799760581007],
			 [54.66197560528215, 39.630058991919334],
			 [54.655058884453986, 39.63915704489752],
			 [54.64903689110616, 39.647740113745],
			 [54.6420577942956, 39.64247176477229],
			 [54.635929097081686, 39.63915094477763],
			 [54.62979947187859, 39.63994999783054],
			 [54.59939178752313, 39.66529052766695],
			 [54.58605804053417, 39.733858455645844],
			 [54.583819024828344, 39.749239041116546]],
			// Координаты вершин внутреннего контура.
			[]
			
		], 
		{
			// Описываем свойства геообъекта.
			// Содержимое балуна.
			//hintContent: "Многоугольник"
		}, 
		{
			// Задаем опции геообъекта.
			// Цвет заливки.
			fillColor: '#00FF0088',
			opacity: 0.5,
			// Ширина обводки.
			strokeWidth: 3,
			strokeColor: '#008800CC'
			
		});
		
		// Добавляем многоугольник на карту.
		myMap.geoObjects.add(myPolygon);
    }